In [4]:
import numpy as np
import pandas as pd 
v1 = np.array([1 ,3 ,6 ,np.NaN , 7 ,1 ,np.NaN ,9 , 15])
v2 = np.array([7 ,np.NaN ,5 ,8 ,12 ,np.NaN ,np.NaN ,2 ,3])
v3 = np.array([np.NaN ,12 ,5 ,6 ,14 ,7 ,np.NaN , 2 ,31])
df = pd.DataFrame(
    {
        "v1" : v1,
        "v2" : v2,
        "v3" : v3
        
    }

)

In [5]:
df

     v1    v2    v3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [6]:
df.isnull()

      v1     v2     v3
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False  False
5  False   True  False
6   True   True   True
7  False  False  False
8  False  False  False

In [7]:
df.isnull().sum()

v1    2
v2    3
v3    2
dtype: int64

In [8]:
df.isnull().sum().sum()

7

In [9]:
df.notnull()

      v1     v2     v3
0   True   True  False
1   True  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False   True
6  False  False  False
7   True   True   True
8   True   True   True

In [10]:
df.notnull().sum()

v1    7
v2    6
v3    7
dtype: int64

In [11]:
df.notnull().sum().sum()

20

In [18]:
df[df.isnull()] # en az bir elemanımnı istediğimizi belirtmemiz lazım

   v1  v2  v3
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN
5 NaN NaN NaN
6 NaN NaN NaN
7 NaN NaN NaN
8 NaN NaN NaN

In [21]:
df[df.notnull().any(axis=1)]
#sutunların en az bir tanesi null olmuyanları getir getir

     v1    v2    v3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [22]:
df[df.notnull().all(axis = 1)]  #sutunlarının hiçbiri null olmayanları getir

     v1    v2    v3
2   6.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [23]:
df[df.isnull().all(axis = 1)] #tüm sutunları boş olanı getir

   v1  v2  v3
6 NaN NaN NaN

In [24]:
df[
    df["v1"].notnull() & df["v2"].notnull() & df["v3"].notnull()
]

     v1    v2    v3
2   6.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [25]:
df.dropna()

     v1    v2    v3
2   6.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [26]:
df

     v1    v2    v3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [27]:
# basit deger atama

In [28]:
df["v1"].mean()

6.0

In [29]:
df["v1"].isnull() = df["v1"].mean() # boyle kullanılmazz :)

SyntaxError: can't assign to function call (<ipython-input-29-9d0b4050b242>, line 1)

In [30]:
df["v1"].fillna(df["v1"].mean())

0     1.0
1     3.0
2     6.0
3     6.0
4     7.0
5     1.0
6     6.0
7     9.0
8    15.0
Name: v1, dtype: float64

In [31]:
df["v2"].fillna(0)

0     7.0
1     0.0
2     5.0
3     8.0
4    12.0
5     0.0
6     0.0
7     2.0
8     3.0
Name: v2, dtype: float64

In [37]:
df["v2"].notnull().mean()

0.6666666666666666

In [38]:
df.apply(lambda x : x.fillna(x.mean()) , axis = 0) #apply döngüü dörevi ve değistirme görevi görür

     v1         v2    v3
0   1.0   7.000000  11.0
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0